define LOGO
\033[1;31m
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣀⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⣀⣤⣶⡿⢿⣛⣛⣛⠛⠷⠶⣤⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⢀⣾⡿⣫⢕⠬⠓⠂⠉⠉⠘⠓⠦⣄⠈⠓⠄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⢠⣿⣟⢜⠔⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⣿⡿⣼⠃⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⢸⣿⡇⢇⣤⡆⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⢸⣿⣷⣿⣿⠃⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⣼⣿⣿⣿⣯⣍⠛⠻⣿⣷⣦⣄⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⢀⣼⣿⣿⣿⣿⣿⣿⢧⠙⢢⠙⢿⣿⣿⣶⣄⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⢀⣤⣿⣿⡿⠟⠛⠛⡫⠕⠃⠀⠀⡇⠀⠉⠻⠿⣿⣿⣶⣤⣤⠀⠀⠀⠀⠀⠀⠀⣀⣀⠀⠀⣀⣀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠉⠉⠁⠀⠀⠀⠀⠈⠣⠀⠀⢠⠃⠀⢀⡀⠤⠄⠀⠒⠒⠒⠒⡢⠜⡩⠔⠊⠁⠀⠀⢀⠤⠐⠒⠫⠴⡠⡀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⡇⢀⠃⡠⠊⠁⠀⠀⠀⠀⠀⠀⡠⢊⡴⠊⠀⠀⠀⠀⢀⠔⠁⢠⠖⠉⠉⠐⢌⠪⢆⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠇⡎⡜⠀⠀⠀⠀⠀⠀⠀⡠⠊⡠⠊⠀⠀⠀⠀⠀⡴⠁⠀⢀⠃⠀⠀⠀⠀⠀⢡⢩⠆⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠘⢼⠀⠀⠀⠀⠀⠀⢀⠔⢡⠎⠀⠀⠀⠀⠀⡠⠊⠀⠀⠀⢸⠀⠀⠀⠀⠀⠀⠀⡌⣼⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠘⢄⠀⠀⠀⢀⡤⢊⠔⠁⠀⠀⠀⢀⡠⠊⣀⣤⣶⣦⣄⠘⡀⠀⠀⠀⠀⠀⢠⠀⠇⡄⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠠⣥⣖⡈⠥⣐⣁⣀⡀⠠⠄⢒⣡⣴⣾⡿⠿⠿⢿⣿⣆⢣⠀⠀⠀⠀⢠⠃⠀⢠⠇⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣿⣿⣿⣷⠀⣀⠄⠒⠒⠛⠛⠉⠉⠀⠈⠛⠻⢶⣮⣛⢦⢦⠀⠀⠀⠎⣼⠀⠘⡘⡄⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣠⣴⣿⡿⠿⠛⠁⣾⣿⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢻⣿⣦⠁⠳⡀⢸⢰⣿⡄⠀⠡⡈⠢⢄⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⣾⢟⠉⠀⠀⠀⠀⠈⣿⣿⡆⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢻⣿⣧⠀⠈⠪⣆⢿⣿⣦⡀⠑⠤⡀⠱⡀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⡏⠎⠀⠀⠀⠀⠀⠀⠘⣿⣿⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⣿⣿⠀⠀⠀⠈⠈⢻⣿⣿⡄⠀⠈⢢⡇
⠀⠀⠀⠀⠀⠀⠀⠀⠀⢷⢣⠀⠀⠀⠀⠀⠀⠀⠈⢿⣧⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢈⣿⡿⠀⠀⠀⠀⠀⠀⠹⣿⣷⠀⠀⠘⠁
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⡈⢄⠀⠀⠀⠀⠀⠀⠀⠈⣿⡆⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣸⣿⠃⠀⠀⠀⠀⠀⠀⠀⢹⣿⡆⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠣⡈⢆⠀⠀⠀⠀⠀⠀⠀⢸⣧⡀⠀⠀⠀⠀⠀⠀⠀⠀⣠⡿⡃⠀⠀⠀⠀⠀⠀⠀⠀⠀⣿⡇⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⠺⠄⠀⠀⠀⠀⠀⠀⢸⣇⡇⠀⠀⠀⠀⠀⠀⠀⣰⢟⢵⠃⠀⠀⠀⠀⠀⠀⠀⠀⠀⣿⣹⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣠⣫⣊⡇⠀⠀⠀⠀⠀⣠⢞⣵⣋⠆⠀⠀⠀⠀⠀⠀⠀⠀⢀⡼⡱⢹⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⠁⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
\033[0m
endef
export LOGO

# Compilador e flags
CC          := cc
CFLAGS      := -Wall -Wextra -Werror

# Diretórios
SRC_DIR     := src
OBJ_DIR     := obj
MLX_DIR     := mlx_linux
NAME        := so_long

# Arquivos fonte
SRC_FILES   := main.c

SRCS        := $(addprefix $(SRC_DIR)/, $(SRC_FILES))
OBJS        := $(SRCS:$(SRC_DIR)/%.c=$(OBJ_DIR)/%.o)

# Cores
GREEN       := \033[1;32m
YELLOW      := \033[1;33m
RED         := \033[1;31m
BLUE        := \033[1;34m
RESET       := \033[0m

all: $(MLX_DIR)/libmlx_Linux.a $(NAME)

# Regra principal
$(NAME): $(OBJS)
	@echo "$$LOGO"
	@echo "$(BLUE)🔧 Linking $(NAME)...$(RESET)"
	@$(CC) $(OBJS) -L$(MLX_DIR) -lmlx_Linux -L/usr/lib -I$(MLX_DIR) -lXext -lX11 -lm -lz -o $(NAME)
	@echo "$(GREEN)✅ Build complete: $(NAME)$(RESET)"

# Compilação dos .o
$(OBJ_DIR)/%.o: $(SRC_DIR)/%.c | $(OBJ_DIR)
	@mkdir -p $(dir $@)
	@$(CC) $(CFLAGS) -I$(MLX_DIR) -O3 -c $< -o $@
	@echo "$(YELLOW)Compiled:$(RESET) $<"

# MiniLibX
$(MLX_DIR)/libmlx_Linux.a:
	@echo "$(BLUE)📦 Building MiniLibX...$(RESET)"
	@$(MAKE) -C $(MLX_DIR)

# Diretório de objetos
$(OBJ_DIR):
	@mkdir -p $(OBJ_DIR)

clean:
	@echo "$(RED)🧹 Removing object files...$(RESET)"
	@rm -rf $(OBJ_DIR)
	@$(MAKE) -C $(MLX_DIR) clean 2>/dev/null || true

fclean: clean
	@echo "$(RED)🗑️  Removing executables...$(RESET)"
	@rm -f $(NAME)

re: fclean all

# Teste
test: $(NAME)
	@echo "$(BLUE)🚀 Testing $(NAME)...$(RESET)"
	@./$(NAME)

.PHONY: all clean fclean re test
.SILENT: